[Killed] EqualityOperator
src/operacoes.js:8:7
 function subtracao(a, b) { return a - b; }
 function multiplicacao(a, b) { return a * b; }
 function divisao(a, b) {
-  if (b === 0) throw new Error('Divisão por zero não é permitida.');
+  if (b !== 0) throw new Error('Divisão por zero não é permitida.');
   return a / b;
 }
killedBy: Suite de Testes para 50 Operacoes Aritmeticas 4. deve dividir e lancar erro para divisao por zero
statusReason: Error: Divisão por zero não é permitida.

[Killed] EqualityOperator
src/operacoes.js:13:7
 }
 function potencia(base, expoente) { return Math.pow(base, expoente); }
 function raizQuadrada(n) {
-  if (n < 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
+  if (n >= 0) throw new Error('Não é possível calcular a raiz quadrada de um número negativo.');
   return Math.sqrt(n);
 }
killedBy: Suite de Testes para 50 Operacoes Aritmeticas 6. deve calcular a raiz quadrada de um quadrado perfeito
statusReason: Error: Não é possível calcular a raiz quadrada de um número negativo.

[Killed] EqualityOperator
src/operacoes.js:19:7
 function restoDivisao(dividendo, divisor) { return dividendo % divisor; }
 function fatorial(n) {
   if (n < 0) throw new Error('Fatorial não é definido para números negativos.');
-  if (n === 0 || n === 1) return 1;
+  if (n !== 0 || n === 1) return 1;
   let resultado = 1;
   for (let i = 2; i <= n; i++) { resultado *= i; }
killedBy: Suite de Testes para 50 Operacoes Aritmeticas 8. deve calcular o fatorial de um numero maior que 1
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 24
Received: 1

[Killed] StringLiteral
src/operacoes.js:34:45
 
 // === Bloco 2: Operações em Arrays e Checagens (11-20) ===
 function maximoArray(numeros) {
-  if (numeros.length === 0) throw new Error('Array vazio не possui valor máximo.');
+  if (numeros.length === 0) throw new Error("");
   return Math.max(...numeros);
 }
killedBy: Casos de borda para fortalecer a suite contra mutantes deve tratar corretamente arrays vazios
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Array vazio"
Received message:   ""

      150 |   } else {
      151 |     stryCov_9fa48("48");
    > 152 |     if (stryMutAct_9fa48("51") ? numeros.length !== 0 : (stryCov_9fa48("51"), numeros.length === 0)) throw new Error(stryMutAct_9fa48("52") ? "" : (stryCov_9fa48("52"), 'Array vazio не possui valor máximo.'));

[Killed] ArithmeticOperator
src/operacoes.js:43:28
 }
 function valorAbsoluto(n) { return Math.abs(n); }
 function arredondar(n) { return Math.round(n); }
-function isPar(n) { return n % 2 === 0; }
+function isPar(n) { return n * 2 === 0; }
 function isImpar(n) { return n % 2 !== 0; }
 function calcularPorcentagem(percentual, valor) { return (valor * percentual) / 100; }
killedBy: Suite de Testes para 50 Operacoes Aritmeticas 15. deve retornar true para um numero par
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Survived] EqualityOperator
src/operacoes.js:88:7
   return numeros.reduce((acc, val) => acc * val, 1);
 }
 function clamp(valor, min, max) {
-  if (valor < min) return min;
+  if (valor <= min) return min;
   if (valor > max) return max;
   return valor;

[Killed] ArithmeticOperator
src/operacoes.js:92:51
   if (valor > max) return max;
   return valor;
 }
-function isDivisivel(dividendo, divisor) { return dividendo % divisor === 0; }
+function isDivisivel(dividendo, divisor) { return dividendo * divisor === 0; }
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
killedBy: Suite de Testes para 50 Operacoes Aritmeticas 37. deve verificar se um numero e divisivel por outro
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] StringLiteral
src/operacoes.js:96:32
 function celsiusParaFahrenheit(celsius) { return (celsius * 9/5) + 32; }
 function fahrenheitParaCelsius(fahrenheit) { return (fahrenheit - 32) * 5/9; }
 function inverso(n) {
-  if (n === 0) throw new Error('Não é possível inverter o número zero.');
+  if (n === 0) throw new Error("");
   return 1 / n;
 }
killedBy: Casos de borda para fortalecer a suite contra mutantes deve validar mensagens de erro especificas nas operacoes com excecao
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Não é possível inverter o número zero."
Received message:   ""

      412 |   } else {
      413 |     stryCov_9fa48("161");
    > 414 |     if (stryMutAct_9fa48("164") ? n !== 0 : (stryCov_9fa48("164"), n === 0)) throw new Error(stryMutAct_9fa48("165") ? "" : (stryCov_9fa48("165"), 'Não é possível inverter o número zero.'));
